quest_system_436562520_name=^?^Storming Creiston
quest_system_436562520_stage_0=^?^Take Creiston castle by storm.
quest_system_436562520_stage_1=^?^Report to the king that you've conducted the operation successfully.
quest_system_436562520_task=^?^As it turns out, Baron Ahey organized the attack on both the dwarves, who were carrying the payment for the Creiston Mines, and the dwarven miners as well. This has resulted in the armed conflict between Kordar and Darion. You are to punish the betrayer.<br>[reward]
